In [18]:
import numpy as np
import pandas as pd
import re

In [5]:
labor_market_statistics = pd.read_csv('Datasets/labor_market_statistics.csv')
labor_market_statistics_legend = pd.read_csv('Datasets/Code Legends/labor_market_stats_legend.csv')

In [9]:
labor_market_statistics.head()

,Year,Month,YBZY,YBZR,YBZQ,YBZT,YBZS,YBZV,YBZU,YBZW,...,LF3M,AIYW,LF3T,LF45,YCGN,AIYX,DZ36,LF3S,LF44,YCGM
0,1992,YEAR,38376.0,88044.0,24636.0,37656.0,50388.0,64752.0,118176.0,53424.0,...,71.5,6.0,67.7,60.8,6072.0,6.6,NaN,71.3,57.9,9264.0
1,1993,YEAR,38184.0,89076.0,23628.0,38556.0,50520.0,64968.0,119064.0,54096.0,...,70.8,5.2,67.5,60.8,6132.0,6.2,NaN,71.3,58.4,9360.0
2,1994,YEAR,38400.0,89784.0,22248.0,39024.0,50772.0,65016.0,119376.0,54360.0,...,71.5,5.2,69.3,61.2,5568.0,6.1,NaN,70.5,57.0,8592.0
3,1995,YEAR,38436.0,90072.0,21516.0,39492.0,50568.0,65604.0,120468.0,54864.0,...,71.4,5.2,69.8,60.3,5016.0,6.1,NaN,72.2,58.4,7908.0
4,1996,YEAR,39192.0,89976.0,20952.0,39780.0,50184.0,65772.0,121524.0,55752.0,...,72.1,5.7,70.0,61.6,4656.0,6.8,NaN,72.9,58.5,7392.0

In [12]:
labor_market_statistics_legend.head()

                                               Title  CDID   Unit
0  LFS: Economically active: UK: Male: Aged 50-64...  YBZY  000's
1  LFS: Economically active: UK: All: Aged 25-34:...  YBZR  000's
2  LFS: Economically active: UK: Female: Aged 18-...  YBZQ  000's
3  LFS: Economically active: UK: Female: Aged 25-...  YBZT  000's
4  LFS: Economically active: UK: Male: Aged 25-34...  YBZS  000's

In [13]:
labor_market_statistics.describe()

,Year,YBZY,YBZR,YBZQ,YBZT,YBZS,YBZV,YBZU,YBZW,JPC3,...,LF3M,AIYW,LF3T,LF45,YCGN,AIYX,DZ36,LF3S,LF44,YCGM
count,324.000000,322.000000,322.000000,322.000000,322.000000,322.000000,322.000000,322.000000,322.000000,218.000000,...,322.000000,322.000000,322.000000,322.000000,322.000000,322.000000,74.000000,322.000000,322.000000,322.000000
mean,2009.388889,10769.878882,18642.186335,4906.537267,8477.003106,10164.990683,15404.714286,28979.785714,13575.086957,2.550917,...,74.414907,9.008696,71.050000,66.234161,613.080745,10.232609,131.891892,73.667081,63.912422,1079.307453
std,5.767691,12388.813285,22382.091688,5795.811994,10105.938143,12281.160677,18046.810211,33833.938916,15791.136565,0.686824,...,1.887397,1.590916,1.731462,2.220511,915.699909,1.724866,7.819413,1.461757,2.689109,1520.665722
min,1992.000000,3661.000000,6604.000000,1708.000000,3001.000000,3597.000000,5659.000000,10605.000000,4925.000000,1.300000,...,70.300000,5.200000,67.500000,60.300000,132.000000,6.100000,116.800000,70.500000,57.000000,248.000000
25%,2005.000000,4086.250000,6856.250000,1876.250000,3117.500000,3747.250000,5896.000000,11171.250000,5284.500000,2.100000,...,73.525000,8.100000,69.725000,64.800000,181.250000,9.225000,127.000000,72.825000,62.100000,328.000000
50%,2009.500000,4493.000000,7392.000000,1939.000000,3404.500000,3992.000000,6070.500000,11436.500000,5371.000000,2.400000,...,74.200000,9.000000,71.400000,65.800000,257.500000,10.300000,130.000000,74.000000,63.700000,462.000000
75%,2014.000000,15848.000000,27104.000000,7414.000000,12259.000000,14803.000000,23516.000000,44564.000000,21038.000000,2.900000,...,75.675000,9.500000,72.300000,66.675000,690.000000,10.900000,135.600000,74.700000,65.100000,1241.000000
max,2019.000000,58296.000000,92916.000000,24636.000000,42948.000000,50772.000000,73728.000000,139104.000000,65580.000000,4.600000,...,79.700000,13.200000,74.800000,71.400000,6132.000000,14.700000,152.800000,76.900000,71.200000,9360.000000

In [10]:
labor_market_statistics['Month'].value_counts()

YEAR    27
APR     19
MAR     19
JUN     19
JUL     19
Q2      19
MAY     19
Q1      19
FEB     19
JAN     19
Q4      18
Q3      18
AUG     18
SEP     18
NOV     18
DEC     18
OCT     18
Name: Month, dtype: int64

Clean the labels, get the names of statistics

In [84]:
def get_statistic_name_lfs(column_name):
    return column_name.split(':')[1].strip()

In [85]:
lm_stats_legend = labor_market_statistics_legend
lfs_legend = lm_stats_legend[lm_stats_legend['Title'].apply(lambda x: x[:3] == 'LFS')]

                                                 Title  CDID   Unit
0    LFS: Economically active: UK: Male: Aged 50-64...  YBZY  000's
1    LFS: Economically active: UK: All: Aged 25-34:...  YBZR  000's
2    LFS: Economically active: UK: Female: Aged 18-...  YBZQ  000's
3    LFS: Economically active: UK: Female: Aged 25-...  YBZT  000's
4    LFS: Economically active: UK: Male: Aged 25-34...  YBZS  000's
..                                                 ...   ...    ...
247  LFS: ILO unemployed: Aged 25-34: UK: Male: 000...  YCGN  000's
248  LFS: Econ. inactivity rate: Aged 16-24: Not in...  AIYX      %
250  LFS: Employment rate: East Midlands: Aged 16-6...  LF3S      %
251  LFS: Employment rate: North East: Aged 16-64: ...  LF44      %
252  LFS: ILO unemployed: Aged 25-34: UK: All: 000s...  YCGM  000's

[236 rows x 3 columns]

In [115]:
field_names_lfs = lfs_legend['Title'].str.split(':', n=-1, expand=True)
lfs_legend['statistic_name'] = field_names_lfs[1].str.strip()
lfs_legend['further_info'] = field_names_lfs[2].str.strip()
lfs_legend['further_info2'] = field_names_lfs[3].str.strip()
lfs_legend['further_info3'] = field_names_lfs[4].str.strip()

In [116]:
lfs_legend

,Title,CDID,Unit,statistic_name,further_info,further_info2,further_info3
0,LFS: Economically active: UK: Male: Aged 50-64...,YBZY,000's,Economically active,UK,Male,Aged 50-64
1,LFS: Economically active: UK: All: Aged 25-34:...,YBZR,000's,Economically active,UK,All,Aged 25-34
2,LFS: Economically active: UK: Female: Aged 18-...,YBZQ,000's,Economically active,UK,Female,Aged 18-24
3,LFS: Economically active: UK: Female: Aged 25-...,YBZT,000's,Economically active,UK,Female,Aged 25-34
4,LFS: Economically active: UK: Male: Aged 25-34...,YBZS,000's,Economically active,UK,Male,Aged 25-34
...,...,...,...,...,...,...,...
247,LFS: ILO unemployed: Aged 25-34: UK: Male: 000...,YCGN,000's,ILO unemployed,Aged 25-34,UK,Male
248,LFS: Econ. inactivity rate: Aged 16-24: Not in...,AIYX,%,Econ. inactivity rate,Aged 16-24,Not in full-time educ.,UK
250,LFS: Employment rate: East Midlands: Aged 16-6...,LF3S,%,Employment rate,East Midlands,Aged 16-64,All
251,LFS: Employment rate: North East: Aged 16-64: ...,LF44,%,Employment rate,North East,Aged 16-64,Female
252,LFS: ILO unemployed: Aged 25-34: UK: All: 000s...,YCGM,000's,ILO unemployed,Aged 25-34,UK,All

We can use dataset 3 which splits the labour market into age groups, male/female, unemployment data. Helps us figure out which age group / gender / education level has been most affected by brexit (probably unemployed). For e.g. Age group men 40-50 vs age group 30-40 females educated similar in how they are affected by brexit. Why?

In [117]:
lfs_legend['statistic_name'].value_counts()

Economic activity rate                         27
Employment rate                                26
In employment                                  24
Temporary employees                            18
Econ. inactive                                 18
Unemployment rate                              18
Part-time workers                              18
Unemployed                                     18
Economically inactive                          12
Econ. inactivity rate                          11
Economically active                            11
Self-employed                                   6
Employees                                       6
Temporary employees as a % of all employees     3
ILO unemployed                                  3
Economic inactivity rate                        3
Workers with second jobs                        3
ILO unemployment rate                           3
Econ. inact. rate                               3
In Employment                                   2
ILO unemployed up to 6 months                   2
ILO unemployed over 24 months                   1
Name: statistic_name, dtype: int64

In [118]:
employed_legend = lfs_legend[lfs_legend['statistic_name'] == 'Employment rate']

In [119]:
employed_legend

,Title,CDID,Unit,statistic_name,further_info,further_info2,further_info3
112,LFS: Employment rate: Aged 16-17: Not in full-...,AIWM,%,Employment rate,Aged 16-17,Not in full-time education,UK
114,LFS: Employment rate: Aged 18-24: Not in full-...,AIWN,%,Employment rate,Aged 18-24,Not in full-time education,UK
115,LFS: Employment rate: Aged 18-24: Not in full-...,AIWK,%,Employment rate,Aged 18-24,Not in full-time education,UK
117,LFS: Employment rate: Aged 16-24: Not in full-...,AIWL,%,Employment rate,Aged 16-24,Not in full-time education,UK
119,LFS: Employment rate: Aged 16-24: Not in full-...,AIWI,%,Employment rate,Aged 16-24,Not in full-time education,UK
121,LFS: Employment rate: Aged 16-17: Not in full-...,AIWJ,%,Employment rate,Aged 16-17,Not in full-time education,UK
123,LFS: Employment rate: Aged 16-17: Not in full-...,AIWG,%,Employment rate,Aged 16-17,Not in full-time education,UK
125,LFS: Employment rate: Aged 18-24: Not in full-...,AIWH,%,Employment rate,Aged 18-24,Not in full-time education,UK
128,LFS: Employment rate: Aged 16-24: UK: Female: ...,AIWF,%,Employment rate,Aged 16-24,UK,Female
130,LFS: Employment rate: Aged 16-24: UK: Male: %: SA,AIWC,%,Employment rate,Aged 16-24,UK,Male
135,LFS: Employment rate: Aged 16-24: UK: All: %: SA,AIVZ,%,Employment rate,Aged 16-24,UK,All
151,LFS: Employment rate: Aged 16-24: In full-time...,AIXH,%,Employment rate,Aged 16-24,In full-time education,UK
153,LFS: Employment rate: Aged 16-17: In full-time...,AIXF,%,Employment rate,Aged 16-17,In full-time education,UK
154,LFS: Employment rate: Aged 18-24: In full-time...,AIXG,%,Employment rate,Aged 18-24,In full-time education,UK
155,LFS: Employment rate: Aged 18-24: In full-time...,AIXD,%,Employment rate,Aged 18-24,In full-time education,UK
156,LFS: Employment rate: Aged 16-24: In full-time...,AIXE,%,Employment rate,Aged 16-24,In full-time education,UK
157,LFS: Employment rate: Aged 16-24: In full-time...,AIXB,%,Employment rate,Aged 16-24,In full-time education,UK
158,LFS: Employment rate: Aged 16-17: In full-time...,AIXC,%,Employment rate,Aged 16-17,In full-time education,UK
160,LFS: Employment rate: Aged 18-24: In full-time...,AIXA,%,Employment rate,Aged 18-24,In full-time education,UK
161,LFS: Employment rate: Aged 16-17: In full-time...,AIWY,%,Employment rate,Aged 16-17,In full-time education,UK
162,LFS: Employment rate: Aged 16-24: Not in full-...,AIWX,%,Employment rate,Aged 16-24,Not in full-time education,UK
238,LFS: Employment rate: North East: Aged 16-64: ...,LF3P,%,Employment rate,North East,Aged 16-64,All
245,LFS: Employment rate: West Midlands: Aged 16-6...,LF3T,%,Employment rate,West Midlands,Aged 16-64,All
246,LFS: Employment rate: North West (GOR): Aged 1...,LF45,%,Employment rate,North West (GOR),Aged 16-64,Female
250,LFS: Employment rate: East Midlands: Aged 16-6...,LF3S,%,Employment rate,East Midlands,Aged 16-64,All
251,LFS: Employment rate: North East: Aged 16-64: ...,LF44,%,Employment rate,North East,Aged 16-64,Female